###############################################################################
# Created by write_sdc
# Fri Dec  2 23:15:23 2022
###############################################################################
current_design controller_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clock -period 25.0000 [get_ports {clock}]
set_clock_transition 0.1500 [get_clocks {clock}]
set_clock_uncertainty 0.5000 clock
set_propagated_clock [get_clocks {clock}]
create_clock -name clock_a -period 25.0000 
set_clock_uncertainty 0.5000 clock_a
set_clock_groups -name async_clock -asynchronous \
 -group [get_clocks {clock}] -comment {Async Clock group}
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_control_trigger_in}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_control_trigger_in}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_latch_data_in}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_latch_data_in}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_reset_n_in}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_reset_n_in}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[0]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[0]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[10]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[10]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[11]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[11]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[12]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[12]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[13]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[13]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[14]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[14]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[15]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[15]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[16]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[16]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[17]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[17]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[1]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[1]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[2]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[2]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[3]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[3]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[4]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[4]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[5]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[5]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[6]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[6]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[7]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[7]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[8]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[8]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {la_data_in[9]}]
set_input_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {la_data_in[9]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[0]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[0]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[10]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[10]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[11]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[11]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[12]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[12]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[13]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[13]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[14]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[14]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[15]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[15]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[16]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[16]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[17]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[17]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[18]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[18]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[19]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[19]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[1]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[1]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[20]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[20]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[21]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[21]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[22]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[22]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[23]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[23]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[24]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[24]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[25]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[25]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[26]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[26]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[27]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[27]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[28]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[28]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[29]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[29]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[2]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[2]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[30]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[30]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[31]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[31]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[3]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[3]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[4]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[4]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[5]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[5]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[6]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[6]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[7]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[7]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[8]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[8]}]
set_input_delay 5.0000 -rise -max -add_delay [get_ports {spi_data[9]}]
set_input_delay 5.0000 -fall -max -add_delay [get_ports {spi_data[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_left[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_left[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_left[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_left[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_left[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_left[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_left[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_left[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_left[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_left[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_left[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_left[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_right[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_right[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_right[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_right[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_right[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_right[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_right[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_right[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_right[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_right[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {col_select_right[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {col_select_right[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[10]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[10]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[11]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[11]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[12]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[12]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[13]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[13]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[14]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[14]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[15]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[15]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_left[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_left[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[10]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[10]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[11]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[11]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[12]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[12]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[13]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[13]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[14]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[14]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[15]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[15]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {data_out_right[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {data_out_right[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {inverter_select[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {inverter_select[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_control_trigger_oeb}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_control_trigger_oeb}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[10]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[10]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[11]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[11]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[12]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[12]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[13]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[13]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[14]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[14]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[15]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[15]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[16]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[16]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[17]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[17]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[18]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[18]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[19]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[19]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_driver_io_oeb[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_driver_io_oeb[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_latch_data_oeb}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_latch_data_oeb}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_reset_n_oeb}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_reset_n_oeb}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_update_cycle_complete_oeb}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_update_cycle_complete_oeb}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {io_update_cycle_complete_out}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {io_update_cycle_complete_out}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_left[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_left[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_address_right[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_address_right[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {mem_write_n[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {mem_write_n[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {output_active_left}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {output_active_left}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {output_active_right}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {output_active_right}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[6]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[7]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[8]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_col_select[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_col_select[9]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_left[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_left[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_left[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_left[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_left[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_left[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_left[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_left[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_left[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_left[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_left[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_left[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_right[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_right[0]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_right[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_right[1]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_right[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_right[2]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_right[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_right[3]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_right[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_right[4]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {row_select_right[5]}]
set_output_delay 5.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {row_select_right[5]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {io_control_trigger_oeb}]
set_load -pin_load 0.0729 [get_ports {io_latch_data_oeb}]
set_load -pin_load 0.0729 [get_ports {io_reset_n_oeb}]
set_load -pin_load 0.0729 [get_ports {io_update_cycle_complete_oeb}]
set_load -pin_load 0.0729 [get_ports {io_update_cycle_complete_out}]
set_load -pin_load 0.0729 [get_ports {output_active_left}]
set_load -pin_load 0.0729 [get_ports {output_active_right}]
set_load -pin_load 0.0729 [get_ports {clock_out[9]}]
set_load -pin_load 0.0729 [get_ports {clock_out[8]}]
set_load -pin_load 0.0729 [get_ports {clock_out[7]}]
set_load -pin_load 0.0729 [get_ports {clock_out[6]}]
set_load -pin_load 0.0729 [get_ports {clock_out[5]}]
set_load -pin_load 0.0729 [get_ports {clock_out[4]}]
set_load -pin_load 0.0729 [get_ports {clock_out[3]}]
set_load -pin_load 0.0729 [get_ports {clock_out[2]}]
set_load -pin_load 0.0729 [get_ports {clock_out[1]}]
set_load -pin_load 0.0729 [get_ports {clock_out[0]}]
set_load -pin_load 0.0729 [get_ports {col_select_left[5]}]
set_load -pin_load 0.0729 [get_ports {col_select_left[4]}]
set_load -pin_load 0.0729 [get_ports {col_select_left[3]}]
set_load -pin_load 0.0729 [get_ports {col_select_left[2]}]
set_load -pin_load 0.0729 [get_ports {col_select_left[1]}]
set_load -pin_load 0.0729 [get_ports {col_select_left[0]}]
set_load -pin_load 0.0729 [get_ports {col_select_right[5]}]
set_load -pin_load 0.0729 [get_ports {col_select_right[4]}]
set_load -pin_load 0.0729 [get_ports {col_select_right[3]}]
set_load -pin_load 0.0729 [get_ports {col_select_right[2]}]
set_load -pin_load 0.0729 [get_ports {col_select_right[1]}]
set_load -pin_load 0.0729 [get_ports {col_select_right[0]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[15]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[14]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[13]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[12]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[11]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[10]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[9]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[8]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[7]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[6]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[5]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[4]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[3]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[2]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[1]}]
set_load -pin_load 0.0729 [get_ports {data_out_left[0]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[15]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[14]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[13]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[12]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[11]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[10]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[9]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[8]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[7]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[6]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[5]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[4]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[3]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[2]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[1]}]
set_load -pin_load 0.0729 [get_ports {data_out_right[0]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[9]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[8]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[7]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[6]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[5]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[4]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[3]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[2]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[1]}]
set_load -pin_load 0.0729 [get_ports {inverter_select[0]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[19]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[18]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[17]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[16]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[15]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[14]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[13]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[12]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[11]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[10]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[9]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[8]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[7]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[6]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[5]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[4]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[3]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[2]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[1]}]
set_load -pin_load 0.0729 [get_ports {io_driver_io_oeb[0]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[9]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[8]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[7]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[6]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[5]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[4]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[3]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[2]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[1]}]
set_load -pin_load 0.0729 [get_ports {mem_address_left[0]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[9]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[8]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[7]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[6]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[5]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[4]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[3]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[2]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[1]}]
set_load -pin_load 0.0729 [get_ports {mem_address_right[0]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[9]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[8]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[7]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[6]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[5]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[4]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[3]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[2]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[1]}]
set_load -pin_load 0.0729 [get_ports {mem_write_n[0]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[9]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[8]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[7]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[6]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[5]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[4]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[3]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[2]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[1]}]
set_load -pin_load 0.0729 [get_ports {row_col_select[0]}]
set_load -pin_load 0.0729 [get_ports {row_select_left[5]}]
set_load -pin_load 0.0729 [get_ports {row_select_left[4]}]
set_load -pin_load 0.0729 [get_ports {row_select_left[3]}]
set_load -pin_load 0.0729 [get_ports {row_select_left[2]}]
set_load -pin_load 0.0729 [get_ports {row_select_left[1]}]
set_load -pin_load 0.0729 [get_ports {row_select_left[0]}]
set_load -pin_load 0.0729 [get_ports {row_select_right[5]}]
set_load -pin_load 0.0729 [get_ports {row_select_right[4]}]
set_load -pin_load 0.0729 [get_ports {row_select_right[3]}]
set_load -pin_load 0.0729 [get_ports {row_select_right[2]}]
set_load -pin_load 0.0729 [get_ports {row_select_right[1]}]
set_load -pin_load 0.0729 [get_ports {row_select_right[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_control_trigger_in}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_latch_data_in}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_reset_n_in}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data_clock}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_out[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 4.0000 [current_design]
