###############################################################################
# Created by write_sdc
# Wed Nov 30 23:22:56 2022
###############################################################################
current_design spi_controller
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clock -period 10.0000 [get_ports {clock}]
set_clock_transition 0.1500 [get_clocks {clock}]
set_clock_uncertainty 0.2500 clock
set_propagated_clock [get_clocks {clock}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_data_in[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_data_in[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_data_in[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_data_in[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mosi}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {sclk}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ss_n}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {clock_out}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[20]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[21]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[22]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[23]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[24]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[25]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[26]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[27]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[28]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[29]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[30]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[31]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {data_out[9]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[0]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[1]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[2]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[3]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {miso}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {miso_oeb}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mosi_oeb}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {sclk_oeb}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ss_n_oeb}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {clock_out}]
set_load -pin_load 0.0729 [get_ports {miso}]
set_load -pin_load 0.0729 [get_ports {miso_oeb}]
set_load -pin_load 0.0729 [get_ports {mosi_oeb}]
set_load -pin_load 0.0729 [get_ports {sclk_oeb}]
set_load -pin_load 0.0729 [get_ports {ss_n_oeb}]
set_load -pin_load 0.0729 [get_ports {data_out[31]}]
set_load -pin_load 0.0729 [get_ports {data_out[30]}]
set_load -pin_load 0.0729 [get_ports {data_out[29]}]
set_load -pin_load 0.0729 [get_ports {data_out[28]}]
set_load -pin_load 0.0729 [get_ports {data_out[27]}]
set_load -pin_load 0.0729 [get_ports {data_out[26]}]
set_load -pin_load 0.0729 [get_ports {data_out[25]}]
set_load -pin_load 0.0729 [get_ports {data_out[24]}]
set_load -pin_load 0.0729 [get_ports {data_out[23]}]
set_load -pin_load 0.0729 [get_ports {data_out[22]}]
set_load -pin_load 0.0729 [get_ports {data_out[21]}]
set_load -pin_load 0.0729 [get_ports {data_out[20]}]
set_load -pin_load 0.0729 [get_ports {data_out[19]}]
set_load -pin_load 0.0729 [get_ports {data_out[18]}]
set_load -pin_load 0.0729 [get_ports {data_out[17]}]
set_load -pin_load 0.0729 [get_ports {data_out[16]}]
set_load -pin_load 0.0729 [get_ports {data_out[15]}]
set_load -pin_load 0.0729 [get_ports {data_out[14]}]
set_load -pin_load 0.0729 [get_ports {data_out[13]}]
set_load -pin_load 0.0729 [get_ports {data_out[12]}]
set_load -pin_load 0.0729 [get_ports {data_out[11]}]
set_load -pin_load 0.0729 [get_ports {data_out[10]}]
set_load -pin_load 0.0729 [get_ports {data_out[9]}]
set_load -pin_load 0.0729 [get_ports {data_out[8]}]
set_load -pin_load 0.0729 [get_ports {data_out[7]}]
set_load -pin_load 0.0729 [get_ports {data_out[6]}]
set_load -pin_load 0.0729 [get_ports {data_out[5]}]
set_load -pin_load 0.0729 [get_ports {data_out[4]}]
set_load -pin_load 0.0729 [get_ports {data_out[3]}]
set_load -pin_load 0.0729 [get_ports {data_out[2]}]
set_load -pin_load 0.0729 [get_ports {data_out[1]}]
set_load -pin_load 0.0729 [get_ports {data_out[0]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[3]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[2]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[1]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mosi}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sclk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ss_n}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 4.0000 [current_design]
